__author__ = 'Соловьев Андрей Сергеевич.'

# По представленной схеме(см. следующий слайд) решить следующие задачи:
# 1.Создать таблицы competition, result, sportsman.
# 2.Заполните таблицы тестовыми данными с помощью команды INSERT
# 3.Выдайте всю информацию о спортсменах из таблицы sportsman.
# 4.Выдайте наименование и мировые результаты по всем соревнованиям.
# 5.Выберите имена всех спортсменов, которые родились в 1990 году. 
# 6.Выберите наименование и мировые результаты по всем соревнованиям, установленные 12-05-2010 или 15-05-2010.
# 7.Выберите дату проведения всех соревнований, проводившихся в Москве и полученные на них результаты равны 10 секунд.
# 8.Выберите имена всех спортсменов, у которых персональный рекорд менее 25 с.
# 9.Создать таблицу  как результат выполнения команды SELECT (любую, например, список стран спортсмены в которых никогда не занимали 1-х мест в соревнованиях).
# Домашнее задание представить в виде одного документа со скриншотами запросов и результатами выполнения. Домашнее задание выполнять в любой СУБД.