__author__ = 'Соловьев Андрей Сергеевич.'

# Разработать модель предметной области в соответствии с вариантом:

# Предметная область - предприятие. Разработать класс Enterprise, описывающий работу с предприятием. 
# Разработать класс People, описывающий человека, человек характеризуется параметрами: фамилия, имя, 
# отчество, дата рождения, телефон. Разработать класс Employee на базе класса People, сотрудник 
# характеризуется следующими параметрами: уникальный идентификатор сотрудника, код отдела, заработная плата.

# Предметная область – университет. Разработать класс University, описывающий работы университета. 
# Разработать класс People, описывающий человека, человек характеризуется параметрами: фамилия, имя,
#  отчество, дата рождения, телефон. Разработать класс Student на базе класса People, студент описывается 
# следующими параметрами: уникальный идентификатор студента, ФИО студента, номер группы, признак старосты группы, код специальности.

# Предметная область – магазин. Разработать класс Shop, описывающий работу магазина продуктов. 
# Разработать класс Products, продукт описывается следующими параметрами: уникальный идентификатор, 
# название продукта, стоимость, количество. Разработать класс FruitProduct на базе класс Product, 
# фрукт характеризуется параметрами: страна изготовителя, срок годности.
# 
# Предметная область – автосалон. Разработать класс CarDealership, описывающий работу автосалона. 
# Разработать класс Car, автомобиль описывается следующими параметрами: уникальный идентификатор, 
# марка автомобиля, страна-производитель, год выпуска, объем двигателя, стоимость. 
# Разработать класс Lorry на базе класс Car, грузовик характеризуется: весовым ограничение перевозки.

